use Movie
go

truncate table movies
go

INSERT INTO movies VALUES('阿凡达','詹姆斯.卡梅伦',3,'山姆.沃思因顿,西格妮.韦弗','美国','2009-12-16','在未来世界中，人类为获取另一星球——潘多拉星球资源，启动了阿凡达计划，并以人类与纳美人（潘多拉星球土著）的DNA混血，培养出身高近3米高的“阿凡达”，以方便在潘多拉星球生存及开采矿产。受伤的退役军人杰克，同意接受实验并以他的阿凡达来到天堂般的潘多拉星球。然而，在这唯美幽境里，地上爬的、天上飞的、土里钻的生物却只只巨大且致命……杰克背负重任，身处险境中，在与纳美人首次意外接触后，虽然开启了沟通的可能性，却也即将面临一场意想不到、浩瀚壮烈的世纪冲突，从中他也将获得空前启示……','images/movies/AVATAR.jpg',123.00)

INSERT INTO movies VALUES('2012','罗兰.埃默里赫',3,'Liam JamesAlexandre,HaussmannPhilippe','美国','2009-11-11','杰克·杰克逊（约翰·库萨克饰）带着孩子去黄石公园度假，却发现曾有美好回忆的湖泊已经干涸了，而这个地区也成为了禁区。充满疑惑的他在黄石附近的营地偶然认识了查理。查理告诉他由于自然环境和资源长期被人类掠夺性破坏，地球自身的平衡系统已经面临崩溃，人类即将面临空前的自然灾害。查理说有些国家已经在联合秘密研制并建造可以躲避这个灾难的方舟。杰克逊以为他是个疯子就一笑而过走开了。第二天灾难发生了。强烈的地震伴随大量陨石的坠落，让眼前熟悉的家园变成了人间炼狱。在地球的其他地方，各种各样的自然灾害也以前所未有的规模爆发。杰克逊和众多家庭一样踏上了求生之路。面对全球性的自然灾害，不知何去何从的他突然想起查理提到过的方舟和地图，于是决定前往方舟基地寻找生存的机会。在寻找和前往方舟基地的过程中，杰克逊一家在经历灾难的生死考验之后终于到达了方舟基地。然而已经制造完成的方舟数量远远不能满足从世界各地闻讯涌来的受灾人群。谁去谁留已然成为挑战整个人类的道德抉择。面对灾难，来自不同国家的人类做出了最重要的抉择：“所有人都是平等的，都有平等的生存机会！”最后人类终于在方舟中度过了这一全球性的灾害，获得了继续繁衍和发展的希望。','images/movies/2012.jpg',123.00)

INSERT INTO movies VALUES('暮光之城','凯瑟琳.哈德威克',3,'克里斯坦.斯图尔特,Robert Pattinson','美国','2008-11-17','贝拉是一个与众不同的女孩，她不热爱虚荣，不会像其他女孩一样追求时髦，也不愿伪装自己刻意去和合不来的同学搞好关系。因为母亲再婚的缘故，贝拉搬去和父亲同住。在新学校里，贝拉遇到了一个名叫爱德华的男孩，他跟贝拉遇见过的所有人都不一样，不仅英俊、聪明、幽默，而且跟贝拉非常有共同语言。两人很快就陷入了爱河。然而爱德华的真实身份其实是一个吸血鬼，自从1918年后他就没有变老过，他可以空手制止一辆飞驰的汽车，跑起来快过狮子，但和其他吸血鬼不一样的是，爱德华本人和他的家族选择了一种独特的生活方式，他们并不喝人血。随着交往的深入，爱德华因为贝拉与自己的过分接近，必须强力控制自己嗜血的本能，同时，爱德华家族的死敌也前来挑战，面临种种困难，爱德华和贝拉能有情人终成眷属吗？','images/movies/Twilight.jpg',123.00)

INSERT INTO movies VALUES('特种部队','斯蒂芬.萨默斯',3,'丹尼斯.奎德,查宁.塔图姆,马龙.韦恩斯','美国','2009-08-05','军火商迪斯特罗和逐渐壮大的眼镜蛇部队处兴风作浪、制造恐怖，意图将全世界的和平与安定毁于一旦。当然，有无聊的人就有收拾无聊之人的人。“G.I.Joe”就是美国政府的秘密武器，他们是一支特种部队。其中全是来自世界各地的顶尖级高手，他们不但拥有强大的力量，而且还拥有着默契地团队意识。他们在世界各地阻击眼镜蛇部队的邪恶行径，大战一触即发……','images/movies/The Rise of Cobra.jpg',123.00)

INSERT INTO movies VALUES('变形金刚2','迈克尔.贝',3,'希安.拉博夫,梅根.福克斯','美国','2009-06-18','地球上的战争虽然结束，但变形金刚之间的战争并未告终。红蜘蛛飞回塞博坦星球，打算带着军队再回到地球一决死战。汽车人发现威震天的尸体不见了，原来已被萨克巨人偷走，威震天随后被复活，决心要开始复仇。与此同时，红蜘蛛也正率领塞博坦的援军赶来，汽车人在这时增强了自己的战斗力，一场大战在所难免……在这一集中，山姆因为掌握了有关变形金刚的起源以及在古老时期到访地球的线索而遭到霸天虎的追击。霸天虎为了获取这些信息，妄图生擒山姆。汽车人、美军和其它多国部队联合起来抵抗霸天虎的袭击。霸天虎这边的重要新人物有：信息专家“声波”，组合金刚“大力神”；汽车人这边有“天火”，一个奸角，他因为年纪和不断恶化的健康状况而选择帮助汽车人。','images/movies/Revenge of the Fallen.jpg',123.00)

INSERT INTO movies VALUES('人兽杂交','文森佐.内塔利',3,'阿德里安.布洛迪,萨拉.波莉,戴维.休利特','美国','2010-06-04','两位反叛的科学家艾尔莎和克里夫，挑战法律和道德的约束，要将人类和动物的DNA进行杂交，以创造一个新的物种“Dren”。这个新生物体最终长成了一位漂亮而又危险的带着翅膀的女性怪兽……','images/movies/Splice.jpg',123.00)

INSERT INTO movies VALUES('新铁血战士','尼莫洛德.安塔尔',3,'阿德里安.布洛迪,托弗.戈瑞斯,丹尼.特雷乔','美国','2010-07-09','本片翻拍自1987年版的《铁血战士》，讲述了军方特种部队首领Dutch（俚语指日耳曼条顿人），率领一队士兵深入南美丛林，去搜索一架坠毁的直升机，不料一个嗜血凶残、地球上从未出现过的透明人将队员逐一杀害，最后只剩下Dutch一个人跟怪物展开斗智斗勇的殊死战。','images/movies/NewPredator.jpg',123.00)

INSERT INTO movies VALUES('地球捍卫战','罗兰.埃默里赫',3,'比尔.普尔曼,玛丽.麦克唐奈,杰夫.戈德布拉姆','美国','1996-06-25','话说美国人正准备热烈庆祝七月四日国庆日之前，外星舰队竟大举包围地球，并对美国几个大城市展开致命的攻击。于是智勇双全的美国总统比尔．普尔曼号召世界各国共御外侮，将七月四日就变成地球的独立日。在电脑专家杰夫．戈德布拉姆和黑人空军飞行员威尔．史密斯等人协助下，地球人对外星人展开全面反攻，总统大人更亲自驾驶战斗机冲上第一线。','images/movies/Independence Day.jpg',123.00)

INSERT INTO movies VALUES('地球停转之日','斯科特.德瑞克森',3,'基努.里维斯,珍妮弗.康奈利','美国','2008-12-10','一个从银河系某个星球出发的飞碟向地球无限靠近，最后选择在美国纽约着陆。面对这样一个看似不友好的天外来客，美国警方给出了强烈的回应和攻击。其实来自外星球的智慧生命克拉图踏上地球并非有入侵的妄念，而是带着警示来告知人类－－如果再有“挑衅”之举，践踏和平，地球将惨遭灭亡。随他一同到地球 “造访”的还有一个具有超级强悍的机器人戈特，他具有的超级能量能将人类轻易“放倒”。着陆后，这两个天外来客被警方带到了一个地方进行盘问，警方不友好的行为使得克拉图最终自己从这里逃走。通过与人类的交流和沟通，克拉图开始学习关于地球和人类的诸多知识，也让他对这个人类栖居之地有了了解。一个偶然的机会，克拉图遇到了海伦·班森和她的儿子波比，并在这母子俩的带领下开始了他的纽约之旅。克拉图最终在在林肯纪念堂前驻足，因为他看到了林肯在很久以前发表的文字，而他知道这将是拯救地球的希望。当母子俩开始对克拉图产生怀疑时，克拉图直言不讳地告诉了自己和戈特此行的目的。原来戈特是银河系超级机器人执法小组的成员，他们以捍卫宇宙和平为己任。他们认为人类对宇宙的和平危机越来越深重，因此有必要对地球进行摧毁。较量开始了，克拉图在林肯纪念堂前看到的那一段文字“Klaatu barada nikto”果真是解救人类的密码吗？这场地球毁灭战会打响吗？地球真的会惨遭灭绝？谁将会是最后的救世主？','images/movies/The Day the Earth Stood Still.jpg',123.00)

INSERT INTO movies VALUES('铁拳','德怀特H.里特',3,'鲁克.高斯,盖瑞.丹尼尔斯','美国','2010-08-05','本片改编自经典电玩游戏。主人公为了报杀母之仇，投奔祖父三岛，请求后者训练自己成为强者。后来三岛举办了“铁拳之王”的比赛，主人公发现自己的杀母仇人也是选手之一，于是决定参加比赛与其一决生死。','images/movies/Tekken.jpg',123.00)

INSERT INTO movies VALUES('重生男人','Miguel Sapochnik',3,'裘德.洛,福里斯特.惠特克,艾丽丝.布拉','美国','2010-03-19','讲述的是在不久的将来，人类的器官合法地成为了商品，不过器官的价格令人乍舌，财力贫乏的家庭如果用赊账的方法更换器官，不能及时偿还的话就会被出售公司雇佣的保安闯进家中，一枪毙命后还被取走器官。裘德·洛扮演的主人公雷米本来是这家公司的保安，专门负责催债，没想到一天他发现自己竟然被公司强制植入人造器官，为此他决心与公司对抗……','images/movies/Repo Men.jpg',123.00)

INSERT INTO movies VALUES('未来战警','乔纳森.默斯托',3,'布鲁斯.威利斯','美国','2009-09-24','未来社会，科技的进步日新月异，尤其是网络的发展更是进化到了今时今日的人类无法想像的地步，这一切都是因为坎特博士（詹姆斯·克伦威尔饰）发明了 “机器代理人”这样一种高科技产物。大家根本不需要自己亲自出门，只需要将大脑接入网络，就可以通过由思维来控制的“机器代理人”在替自己做一切想做的事情。这些“机器代理人”的外表可以根据客户的要求定制，可以是一位迷人的金发美女，也可以是一位体格壮硕的硬朗汉子。有了“机器代理人”的社会，一切都化繁为简，生活看上去变得更加完美。只是，在这看似完美的生活下面，总会有一些不那么美好的事情发生。零犯罪率保持了许多年的社会里，突然发生了一起谋杀案，彻底将这个人人向往的乌托邦社会击碎。格里尔（布鲁斯·威利斯饰）是一位经验老到的FBI探员，他和搭档彼得斯（拉妲·米契尔饰）奉命调查这起谋杀案件，随着两人对案件的抽丝剥茧，他们逐渐走进了事件的核心。原来“机器代理人”并非完美社会的解决方案，它的诞生其实是源于一个巨大的阴谋。而讽刺的事，格里尔调查这起案件时一直使用着“机器代理人”。为了真正找出真相，格里尔放弃了使用“机器代理人”而亲自出门调查这起案件，他却突然发现，这个曾经如此熟悉的社会看起来却冰冷陌生，而且危机四伏……','images/movies/Surrogates.jpg',123.00)

INSERT INTO movies VALUES('詹妮弗的肉体','Karyn Kusama',3,'梅根.福克斯,Amanda Seyfried','美国','2009-09-17','在明尼苏达州的一个小镇里，性感火辣的女高中生詹妮弗（梅根·福克斯饰）是这个有点偏远的小镇上最受欢迎的妙龄女郎，身为当地女子啦啦队长的她不仅身材曼妙，而且舞姿撩人，无数男人成了她的裙下之臣，詹妮弗着实享受着这种众星捧月的香艳生活。然而就在一个月黑风高的夜晚，詹妮弗不幸被恶魔附身，从此化身成为极度嗜血的蛇蝎美人，吃人食脑，她的众多追求者一个个命丧黄泉。面对恐怖事件接二连三的不断发生，小镇上唯一知晓内情的妮蒂（阿曼达·塞弗里德饰）手足无措：作为詹妮弗最好的朋友，她狠不下心报警；可是她的软弱、姑息，只会导致越来越多的无辜男子死在詹妮弗手上。究竟应该鼓起勇气干掉詹妮弗，还是眼看着杀人事件愈演愈烈？妮蒂面对着一个两难的抉择……','images/movies/Jennifer Body.jpg',123.00)

INSERT INTO movies VALUES('街头日记','Richard LaGravenese',5,'Damontre Owens,司各特格伦,Jennifer','美国','2007-01-05','加利福尼亚，长岛，在踏进当地威尔森高中的第一天，热血的菜鸟老师艾琳·格鲁维尔（希拉里·斯旺克饰）还是个满怀希望要改变世界的理想主义派。然而她将要面对的，是在LA暴动之后，各种族之间暴徒械斗一触即发的长岛，连本来应该不闻窗外事的学校也不例外。艾琳的班级里，全是被其他老师放弃的青少年，非裔美国人、拉丁美洲人、亚洲人，班级里不仅族裔混杂，都是附近贫困街区的孩子，甚至还有小混混和黑帮团体成员，他们对学习没有丝毫热情。艾琳对于教师这一职业的热情受到了严重的挑战，但她却并没有同其他成年人一样避之唯恐不及，而是学着真正聆听学生的心声。逐渐开始了解学生们的世界的艾琳，痛心地发现这些不过十来岁的孩子们，每天不得不挣扎着在街头暴力中生存，能平安无事地度过每一天就是他们最大的希求。于是艾琳借鉴二战时安妮·弗兰克的做法，让学生们利用日记写下点点滴滴的遭遇，互相分享互相倾诉，从生活里找到希望与自由。从艾琳那里，学生们得到了前所未有的尊重，一本“街头日记”竟改变了他们的人生，使他们得到了救赎！','images/movies/Freedom Writers.jpg',123.00)

INSERT INTO movies VALUES('叶问','叶伟信',0,'甄子丹,熊黛林,任达华,樊少皇','中国香港','2008-12-12','一九三零年代，中国武术之都的佛山，武风顶盛，各门各派为广纳门徒，经常集体比斗以显实力。叶问习得一身武艺但为人低调，故未有设馆授徒，只待在家中与友人闭门切磋、钻研武术。好景不常，中日战争爆发，佛山沦陷，叶家大宅被日军强占，叶问被迫带着妻儿移居废屋。叶问一家生活艰苦，但叶问仍积极面对，一改阔少的态度，到煤炭厂当苦力，自力更生。众中国人默默耕耘之际，一批日军却前来生事，陪伴着日军主任佐腾旁边的翻译官，竟是昔日的佛山巡警李钊！日本将军三蒲是一名武痴，故以白米作奖赏，邀请中国人到打斗场与日军切磋，藉以观摩中国武术。叶问的好友武痴林于打斗场内侮辱三蒲，被活生生击毙！叶问为寻找武痴林，到打斗场查看，甫一进场即见廖师傅被佐腾无理射杀！叶问遂把心中悲愤于打斗场上发泄出来，以一敌十，痛击日本人！三蒲对叶问的身手大为欣赏，并表示期待与叶问一战。三蒲带兵至棉花厂捉拿叶问，要求叶问向日军传授中国武术。叶问不甘作汉奸，且欲替中国人挽回尊严，遂公然挑战三蒲，要以双拳唤起中国人的团结心。三蒲自视甚高，为保名声毅然应战。佐腾为保三蒲胜出竟暗设埋伏，叶问未知已身陷危机，以咏春力战三蒲的空手道，二人在擂台上展开激烈生死决战……','images/movies/Ip Man.jpg',123.00)

INSERT INTO movies VALUES('迫在眉梢','不知道是谁',6,'丹泽尔.华盛顿','美国','2002-01-05','约翰.Q.阿奇伯德（丹泽尔.华盛顿）是个工厂里的工人，他工作很卖命也很顾家，可生活依然不富裕。为了养家糊口，妻子丹妮斯也要上班挣钱，夫妻俩因忙碌而使感情日渐淡漠，婚姻几近破裂。他们生活中唯一的亮点，就是9岁的儿子迈克尔。可不幸总是出其不意地降临到苦命人的身上。一天，迈克尔突然昏到在棒球赛场上，约翰.Q把他送到医院后得知：儿子患有严重的先天性心脏病，需要进行心脏移植手术才能保住性命。 心脏移植手术的费用非常昂贵，而约翰.Q的医疗保险远不足以负担15万美金的手术费。医院的头头（安妮.海切）得知这个情况后，决定把迈克尔从等待移植者的名单中剔除，除非约翰.Q能预付30%的手术费。此举激怒了约翰.Q，在求助于迈克尔的主治医生特纳（詹姆斯.伍兹）未果的情况下，他愤然持枪闯入了医院的急诊室，绑架了几位医护人员和病人做人质，要求院方立刻为儿子动手术。 然而事情并不像约翰.Q想象的那么简单，面对他的不仅是一群无辜又需要护理的人质，还有一个经验丰富的谈判家（罗伯特.杜瓦尔）和一个想要速战速决的警长（雷.利奥塔）。约翰.Q和警方的对峙还惊动了媒体，全市的大众对这一事态的发展都投以了极大的关注。他们的感情似乎更多倾向于违法者约翰.Q，因为他是当今不近人情的医疗和保险制度的受害者。但大众的同情并不能帮助约翰.Q，他的前途到底如何呢？','images/movies/JOHNQ.jpg',123.00)

INSERT INTO movies VALUES('人在囧途','叶伟民',1,'徐峥,王宝强,李曼,李小璐','中国内地','2010-06-04','春节将近，玩具集团老板李成功（徐峥饰）回长沙过年，同时在情人嫚妮（李曼饰）的逼迫下，准备过年后跟老婆离婚。结果，在机场遇到前往长沙讨债的挤奶工牛耿（王宝强饰）后，霉运不断。命运的捉弄，牛耿一路都与李成功不期而遇。两人路途中囧事不断，也遭遇了各式各样的人和千奇百怪好笑的事情，弄得李成功狼狈不堪，高贵形象荡然无存。牛耿（王宝强饰）却不以为意乐观积极。为了能够回家，二人结伴而行，他们换了各种交通方式奔波在回家的路上，飞机，火车，大巴，轮渡，搭货车，甚至拖拉机……但是两人还是在荒郊野外度过了大年三十，回首这一路的艰辛，与他们路途中遇到人或事，对两人人生有了很大触动……最终，在经历了两人从敌对到成为朋友，牛耿的真诚也改变林李成功冷漠的性格，唤起李成功对真情的回归。当疲惫的李成功回到家，却不料嫚妮比他还早到一步，甚至见到了李成功的妻子，李成功懵了，满怀忐忑的李成功回到家看到停留在墙上未撕去的日历，看到其乐融融的妻女与老人，李成功也明白了他该做出什么样的选择。鞭炮响起，李成功与妻子深情相拥，我们知道这一年，李成功回家了，不光是身体，还有心灵……','images/movies/Lost On Journey.jpg',123.00)

INSERT INTO movies VALUES('三傻大闹宝莱坞','拉库马.希拉尼',1,'阿米尔.汗,卡琳娜.卡普,马德哈万,波曼.伊拉妮','印度','2010-08-02','两个好朋友一起结伴而行去寻找另一个失散已久的好兄弟，希望能重组他们的“三人帮”，然而途中却遇到了种种意想不到的事情。‘以无聊抵抗无聊’是烈日当空下的香港学生采取的生存态度，远在印度的年轻学生竟是同道中人，不过不要以为三个小伙子真是傻仔任人摆布，实质上以嬉闹行为抵抗印度填鸭式的教育谬况，当中还奉送热闹的宝莱坞歌舞。少见的印度式校园青春片，捣蛋中又不忘数落印度严重的阶级及自杀问题，《美国处男》式的无聊，《罗密欧与茱丽叶》式的爱情、《红磨坊》式的歌舞，一顿包罗美国味的印度大杂烩，无怪乎深得观众欢心，打破印度票房纪录，创下No.1 的骄人成绩。','images/movies/3 Idiots.jpg',123.00)

INSERT INTO movies VALUES('驯龙记','迪恩·德布洛斯克里斯·桑德斯',3,'克里斯托夫·梅兹','美国','2010-03-25','本片改编自葛蕾熙达·柯维尔（Cressida Cowell）的同名儿童图书，主人公是一位海盗首领的儿子，为了继承衣钵受到众人拥戴，他必须要先去制服凶猛的恶龙来展示自己的能力。然而其间却阴差阳错，遇到了一条个头和力量都不堪一击的小龙，后者甚至连牙齿都没长全，这要他怎么跟众人交差呢？','images/movies/How to Train Your Dragon.jpg',123.00)

INSERT INTO movies VALUES('功夫梦','哈罗德·兹瓦尔特',0,'成龙,贾登·史密斯','美国','2010-06-22','贾登·史密斯将扮演一名在学习功夫之前饱受欺凌的小孩parker，成龙扮演他的功夫师傅，塔拉吉·P·汉森扮演parker的母亲，内地中学生韩雯雯扮演parker的好朋友美莹，内地演员王振威扮演一位学校里的恶霸陆伟程，内地著名童星金世豪在片中饰演成龙的儿子，于荣光扮演陆伟程的老师。Parker初次来到中国，和小提琴拉得很好的美莹结识，但出身龙腾武校的陆伟程带领他的伙伴屡次围打他。一次，陆伟程几人正殴打Parker 时，Parker小区的韩先生（修理工 成龙饰演）及时救了他，Parker在他的带领下去找陆伟程的教练和解，叫陆伟程一伙人不要再欺负他，并答应教练Parker参加武术大赛 。 韩先生收Parker为徒，渐渐Parker武艺越发高强。比赛时，Parker的妈妈、美莹及美莹的爸爸来观赛。Parker冲进决赛，却在决赛第一场时被龙腾武校的学生打伤腿，但他坚持比赛，与陆伟程站在同一个擂台，虽然陆伟程从中使坏，但Parker还是夺得了冠军。陆伟程心服口服，亲自把奖杯递给 Parker，并带龙腾学校参赛队拜韩先生为师。','images/movies/Kung Fu Kid.jpg',123.00)
go

alter table movies drop constraint FK_movies_type
go

truncate table type
go

INSERT INTO type VALUES('动作')
INSERT INTO type VALUES('喜剧')
INSERT INTO type VALUES('爱情')
INSERT INTO type VALUES('科幻')
INSERT INTO type VALUES('恐怖')
INSERT INTO type VALUES('剧情')
INSERT INTO type VALUES('冒险')
INSERT INTO type VALUES('音乐')
INSERT INTO type VALUES('惊险')
INSERT INTO type VALUES('传记')
INSERT INTO type VALUES('历史')
INSERT INTO type VALUES('其他')
go

alter table movies
add constraint FK_movies_type foreign key(typeID) references type(typeID)
go

select * from movies
select * from type
select count(*) from movies where typeID=3
go